Revit 2024 API
WallLocationLine Enumeration
 This enumerated type represents the options for alignment of a wall's location line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum WallLocationLine
Visual Basic
Public Enumeration WallLocationLine
Visual C++
public enum class WallLocationLine
Members
Member name | Description
WallCenterline |  The wall location line is aligned to the center of the wall.
CoreCenterline |  The wall location line is aligned to the center of the core.
FinishFaceExterior |  The wall location line is aligned to the exterior face of the wall.
FinishFaceInterior |  The wall location line is aligned to the interior face of the wall.
CoreExterior |  The wall location line is aligned to the exterior face of the core.
CoreInterior |  The wall location line is aligned to the exterior face of the core.
See Also
Autodesk.Revit.DB Namespace